DataProcessors/ЗонаОтгрузкиТаксист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗонаОтгрузкиТаксист</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист_2</v8:Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолКоробок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Самовывоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолТара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Тара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контейнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТараПЛ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должен</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вернул</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ЗонаОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ЗонаОтгрузки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКоробок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерМестаОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПрихода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/ЗонаОтгрузкиТаксист/Forms/Форма21112013/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.МестоОтгрузки="";
	ФФ=ФФПроверитьНаЗаполнение();
КонецПроцедуры
&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	ФФ=ФФЗаписатьДокументRR();
КонецПроцедуры
&НаКлиенте
Функция ФФЗаписатьДокументRR()
	Если Объект.КолКоробок=0 тогда
		Сообщить ("Укажите количество коробок");
		Возврат 0;
	КонецЕсли;	
	Если не ЗначениеЗаполнено(Объект.МестоОтгрузки) тогда
		Сообщить ("Укажите место отгрузки");
		Возврат 0;
	КонецЕсли;
	Если не ЗначениеЗаполнено(Объект.Док) тогда
		Сообщить ("Не выбран документ");
		Возврат 0;
	КонецЕсли;
	Если Объект.Док.Коробки>0 Тогда
		Режим = РежимДиалогаВопрос.ОКОтмена;
		Ответ=Вопрос("В документе уже есть места отгрузки. Вы хотите добавить или исправить? Если довавить нажмите ОК иначе ОТМЕНА",Режим,0);
		Если Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат 0;
		КонецЕсли;
	КонецЕсли;
	ФФЗаписатьДокументSS();
	ТД.Очистить();
	ФФПроверитьНаЗаполнение();

КонецФункции // ()
&НаСервере
Функция ФФЗаписатьДокументSS()
	ОбъектДок=Объект.Док.ПолучитьОбъект();
	Стр=ОбъектДок.МестаОтгрузки.Добавить();
	Стр.КоличествоКоробок=Объект.КолКоробок;
	Стр.МестоОтгрузки=Объект.МестоОтгрузки;
	ОбъектДок.Коробки=ОбъектДок.МестаОтгрузки.Итог("КоличествоКоробок");
    ОбъектДок.Записать(РежимЗаписиДокумента.Проведение);
КонецФункции // ()
&НаКлиенте
Процедура ТДПриАктивизацииОбласти(Элемент)
	ТекЯчейка=Элемент.ТекущаяОбласть;
	БукваМХ=ТД.ПолучитьОбласть(ТекЯчейка.Верх,1).ТекущаяОбласть.Текст;
	ЦифраМХ=ТД.ПолучитьОбласть(1,ТекЯчейка.Лево).ТекущаяОбласть.Текст;
	Если ЦифраМХ="сек-" тогда
		БукваМХ=ТД.ПолучитьОбласть(ТекЯчейка.Верх,16).ТекущаяОбласть.Текст;
		МХ=ЦифраМХ + БукваМХ;
	Иначе	
		МХ=БукваМХ + ЦифраМХ;
	КонецЕсли;
	ФФ=ФФТДПриАктивизацииОбласти(МХ)
КонецПроцедуры
&НаКлиенте
Функция ФФТДПриАктивизацииОбласти(МХ)
	Текущая=ТД.Область("Текущая");
	//Если МХ<>"" тогда
	//	ТекОбл=ТД.Область(МХ);
	//	//ТекОбл.ЦветФона=Текущая.ЦветФона;
	//КонецЕсли;
	Объект.МестоОтгрузки=Справочники.МестаХранения.НайтиПоНаименованию(МХ);
КонецФункции 
&НаКлиенте
Функция ФФПроверитьНаЗаполнение();
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	  |	ЗонаОтгрузкиОстатки.НомерМестаОтгрузки,
	  |	ЗонаОтгрузкиОстатки.ДокументПрихода,
	  |	ЗонаОтгрузкиОстатки.КоличествоКоробокОстаток
	  |ИЗ
	  |	РегистрНакопления.ЗонаОтгрузки.Остатки КАК ЗонаОтгрузкиОстатки";
	  
	  Результат = Запрос.Выполнить();
	  Выборка = Результат.Выбрать();
	  Макет=Обработки.ЗонаОтгрузки.ПолучитьМакет("Макет");
      ОТГРУЗКА=Макет.ПолучитьОбласть("ОТГРУЗКА");
	  ТД.Вывести(ОТГРУЗКА);
	  НФС=ТД.Область("НФС");
	  АСК=ТД.Область("АСК");
	  Пока Выборка.Следующий() Цикл 
		  МХ=СокрЛП(Выборка.НомерМестаОтгрузки.Наименование);
		  Если Лев(МХ,3)="сек" тогда
			  МХ=Лев(МХ,3)+Прав(МХ,1);
		  КонецЕсли; 
		  Если Лев(МХ,1)="Ж" тогда
			  НЯ=Число(Прав(МХ,СтрДлина(МХ)-1));
			  Если  НЯ < 9 Тогда
				  МХ="Возврат";
			  Иначе
				  МХ="Аптека";
			  КонецЕсли;  
		  КонецЕсли; 
		  ТекОбл=ТД.Область(МХ);
		  Коробок=ТД.Область(ТекОбл.Верх,ТекОбл.Лево);
		  Если Коробок.Текст <> "" тогда
			  ЧКоробок=Число(Коробок.Текст)+Выборка.КоличествоКоробокОстаток;
		  Иначе 
			  ЧКоробок=Выборка.КоличествоКоробокОстаток;
		  КонецЕсли;
		  Коробок.Текст=ЧКоробок;
		  Коробок.Примечание.Текст=Коробок.Примечание.Текст+Выборка.ДокументПрихода+Символы.ПС+"Счет-фактуры"+Выборка.ДокументПрихода.НомераСФ+" "+Выборка.КоличествоКоробокОстаток+" мест"+Символы.ПС+Символы.ПС;
		  Клиентов=ТД.Область(ТекОбл.Верх+1,ТекОбл.Лево);
		  
		  Если Клиентов.Текст <> "" тогда 
			  ЧКоробок=Число(Клиентов.Текст)+1;
		  Иначе 
			  ЧКоробок=1;
		  КонецЕсли;
		  Клиентов.Текст=ЧКоробок;
		  Клиентов.Примечание.Текст=Клиентов.Примечание.Текст+Выборка.ДокументПрихода.Получатель+" "+Выборка.КоличествоКоробокОстаток+" мест"+Символы.ПС;
		  Время=ТД.Область(ТекОбл.Верх+2,ТекОбл.Лево); 
		  Начало=Выборка.ДокументПрихода.НачалоОтгрузки;
			  Ч=Цел((ТекущаяДата()-Начало)/60/60);
			  М=Цел((ТекущаяДата()-Начало)/60)-Ч*60;
		  
		  Если Время.Текст<>"" тогда
			 ТекЧ=Число(Лев(Время.Текст,Найти(Время.Текст," ")-1)); 
			 Если Ч>ТекЧ тогда
				 
			 КонецЕсли;	 
		  Иначе
			  
		  КонецЕсли;	
		  
		 
			  ЧКоробок=Строка(Ч)+" ч. "+М+" м.";
		  Время.Текст=ЧКоробок;
		  Время.Примечание.Текст=Клиентов.Примечание.Текст+Выборка.ДокументПрихода.НачалоОтгрузки+Символы.ПС;
		  
		  Если Выборка.ДокументПрихода.Организация = "НФС" тогда
			  Если ТекОбл.ЦветФона=АСК.ЦветФона тогда
				  ТекОбл.ЦветФона=НФС.ЦветФона ;
				  Клиентов.ЦветФона=АСК.ЦветФона ;
			  Иначе
				  ТекОбл.ЦветФона=НФС.ЦветФона ;
			  КонецЕсли;
		  Иначе
			  Если ТекОбл.ЦветФона=НФС.ЦветФона тогда
				  ТекОбл.ЦветФона=АСК.ЦветФона ;
				  Клиентов.ЦветФона=НФС.ЦветФона ;
			  Иначе
				  ТекОбл.ЦветФона=АСК.ЦветФона ;
			  КонецЕсли;
			  ТекОбл.ЦветФона=АСК.ЦветФона ;
		  КонецЕсли;  
	  КонецЦикла;
КонецФункции 

&НаКлиенте
Процедура Обнавить(Команда)
	ТД.Очистить();
	ФФПроверитьНаЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	Если Источник = "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
		ШК = Лев(Данные, СтрДлина(Данные) - 1);	
		Если ЗначениеЗаполнено(ШК) Тогда
			Если ЗначениеЗаполнено(СокрЛП(ШК)) Тогда
				Если 12 = СтрДлина(ШК) Тогда
					//Если мВозврат Тогда
					//	НайтиДокументыПогрузки(ШК);
					//КонецЕсли;  
					Док = НайденыйДок(ШК,ложь);
					Объект.ШК=ШК ;
					Объект.Док=Док;
					Если НЕ ЗначениеЗаполнено(Док) Тогда
						ОчиститьСообщения();
						Сообщить("Документ не найден!!!");
					Иначе 
						//ОткрытьЗначение(Док);
						ПроверитьОстаткиПоКлиенту(Док);
					КонецЕсли;
				Иначе
					Сообщить("Не правильно введен штрих код!! Будьте внимательны при сканировании!");
				КонецЕсли;
			Иначе
				Сообщить("Введите Штрих Код!",СтатусСообщения.ОченьВажное);
			КонецЕсли;
		ИначеЕсли Источник <> "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
			Сообщить("Сканер Штрих кода не подключен! Устраните неполадку!");		
		ИначеЕсли Источник = "СканерШтрихкода" И Событие = "Barcode" И НЕ ЗначениеЗаполнено(Данные) Тогда
			Сообщить("Сканер не может считать данные.");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Процедура ПроверитьОстаткиПоКлиенту(Док)
	Текущая=ТД.Область("Текущая");
	Клиент=Док.Получатель;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.НомерМестаОтгрузки,
		|	ТоварыНаСкладахОстатки.КоличествоКоробокОстаток
		|ИЗ
		|	РегистрНакопления.ЗонаОтгрузки.Остатки КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|	ТоварыНаСкладахОстатки.КоличествоКоробокОстаток > 0
		|	И ТоварыНаСкладахОстатки.ДокументПрихода.Получатель = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", Клиент);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
       Сообщить("ПОДСКАЗКА");
	   Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		   Сообщить("Товар Клиента - "+Клиент+ " Лежит на месте - "+ВыборкаДетальныеЗаписи.НомерМестаОтгрузки+" коробок - "+ВыборкаДетальныеЗаписи.КоличествоКоробокОстаток);	
		   МХ=СокрЛП(ВыборкаДетальныеЗаписи.НомерМестаОтгрузки.Наименование);
		   Если Лев(МХ,3)="сек" тогда
			   МХ=Лев(МХ,3)+Прав(МХ,1);
		   КонецЕсли; 
		   Если Лев(МХ,1)="Ж" тогда
			   НЯ=Число(Прав(МХ,СтрДлина(МХ)-1));
			   Если  НЯ < 9 Тогда
				   МХ="Возврат";
			   Иначе
				   МХ="Аптека";
			   КонецЕсли;  
		   КонецЕсли; 
		   ТекОбл=ТД.Область(МХ);
		   ТекОбл.ЦветФона=Текущая.ЦветФона;
	   КонецЦикла;
КонецПроцедуры
Функция НайденыйДок(Ном, мВозврат)
	//КодДокумента = ОбщийМодуль_Каштан.ПолучитьНомерДокументаПоШК(ШК);
	
	Если Ном = Неопределено тогда
		Сообщить("Документ не найден!!!");
		Возврат Неопределено;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БольшаяЯчеистаяСборкаДокументыРасхода.Ссылка
		|ИЗ
		|	Документ.БольшаяЯчеистаяСборка.ДокументыРасхода КАК БольшаяЯчеистаяСборкаДокументыРасхода
		|ГДЕ
		|	БольшаяЯчеистаяСборкаДокументыРасхода.ШК = &ШК";
		Запрос.УстановитьПараметр("ШК", Ном);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Если мВозврат Тогда
				ВыборкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ВыборкаОбъект.МестаОтгрузки.Очистить();
				ВыборкаОбъект.Записать();
				Возврат ВыборкаОбъект.Ссылка;
			Иначе
				Возврат Выборка.Ссылка;
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли; 
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ШКПриИзменении(Элемент)
	ТД.Очистить();
	ФФПроверитьНаЗаполнение();	
	Док = НайденыйДок(Объект.ШК, ложь);
	Объект.Док=Док;
	ПроверитьОстаткиПоКлиенту(Док);
КонецПроцедуры

&НаКлиенте
Процедура ДокПриИзменении(Элемент) 
	ТД.Очистить();
	ФФПроверитьНаЗаполнение();	
	ПроверитьОстаткиПоКлиенту(Объект.Док);
КонецПроцедуры
